
nc: 80  # number of classes
scales:   # [depth, width, max_channels]
  # B: [0.33, 0.50, 1024]  # Mamba-YOLOv8-B summary:   21.8M parameters,  49.7 GFLOPs
  T: [0.33, 0.25, 1024]  #Mamba-YOLOv8-T summary: 6.1M parameters,   14.3GFLOPs


# Mamba-YOLO backbone 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]   # 0-P2/4
  - [-1, 3, VSSBlock, [128]]
  # - [-1, 3, C2f, [128, True]]               # 1
  # - [-1, 3, C3, [128]]
  - [-1, 1, VisionClueMerge, [256]]      # 2 p3/8
  - [-1, 3, VSSBlock, [256]]
  # - [-1, 6, C2f, [256, True]]              # 3
  # - [-1, 3, C3, [256]]
  - [-1, 1, VisionClueMerge, [512]]      # 4 p4/16
  - [-1, 9, VSSBlock, [512]]
  # - [-1, 6, C2f, [512, True]]              # 5
  # - [-1, 3, C3, [512]]
  - [-1, 1, VisionClueMerge, [1024]]      # 6 p5/32
  - [-1, 3, VSSBlock, [1024]]
  # - [-1, 3, C2f, [1024, True]]              # 7
  # - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]               # 8

# Mamba-YOLO PAFPN
head:
  - [-1, 1, Dysample, []]
  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, XSSBlock, [512]]  
  # - [-1, 3, C2f, [512]] # 12# 11
  # - [-1, 3, C3, [512]]

  - [-1, 1, Dysample, []]
  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, XSSBlock, [256]]  # 14 (P3/8-small)
  # - [-1, 3, C2f, [256]] # 15 (P3/8-small)
  # - [-1, 3, C3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, XSSBlock, [512]]  # 17 (P4/16-medium)
  # - [-1, 3, C2f, [512]] # 18 (P4/16-medium)
  # - [-1, 3, C3, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, XSSBlock, [1024]]  # 20 (P5/32-large)
  # - [-1, 3, C2f, [1024]] # 21 (P5/32-large)
  # - [-1, 3, C3, [1024]]

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)
